mimou-77/matter_light/sdkconfig.defaults.c6_thread
CONFIG_IDF_TARGET="esp32c6"

# OpenThread — all sub-configs required, not just ENABLED
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable WiFi — Thread is the sole transport
CONFIG_ENABLE_WIFI_STATION=n

# IPv6 — autoconfig must be OFF for Thread (OpenThread manages addresses)
CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# mDNS — Thread requires extended discovery, not minimal mDNS
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Partition table — Thread needs NVS space for operational dataset
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xC000

CONFIG_VOLET_TRANSPORT_THREAD=y